#1 Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]. Вывидете все элементы которые меньше 5.
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
print([elem for elem in a if elem < 5])

#2 Даны списки:
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
#Нужно вернуть список, который состоит из элементов, общих для этих двух списков.
#-------------------------------2.1----------------------------
print(list(set(a) & set(b)))
#-------------------------------2.2----------------------------
result = []
for elem in a:
    if elem in b:
        result.append(elem)
print(result)
#-------------------------------2.3-----------------------------
result = [elem for elem in a if elem in b]
print(result)

#3 Отсортируйте словарь по значению в порядке возрастания и убывания.
d = {1: 2, 3: 4, 4: 3, 2: 1, 0: 0}
result1 = dict(sorted(d.items()))
result = dict(sorted(d.items(), reverse=True))
print(result1, result)

#4 Напишите программу для слияния нескольких словарей в один.
dict1 = dict(a=1, b=2, c=3, d=4)
dict2 = dict(e=5, f=6, g=7, h=8)
result = {}
for solution in (dict1, dict2):
    result.update(solution)
print(result)

#5 Найдите три ключа с самыми высокими значениями в словаре my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}.
my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}
result = sorted(my_dict, key=my_dict.get, reverse=True)[:3]    # key - аргумент метода sorted. Используется как ключ. Для извлечения используем метод get()
print(result)

